{
    "_name_or_path": "/srv/hays-lab/scratch/sanisetty3/music_motion/clap/clamp",
    "architectures": [
      "ClampModel"
    ],
    "audio_config": {
      "depths": [
        2,
        2,
        12,
        2
      ],
      "hidden_size": 1024,
      "model_type": "clap_audio_model",
      "patch_embeds_hidden_size": 128
    },
    "hidden_size": 768,
    "initializer_factor": 1.0,
    "logit_scale_init_value": 14.285714285714285,
    "model_type": "clamp",
    "num_hidden_layers": 16,
    "projection_dim": 512,
    "projection_hidden_act": "relu",
    "text_config": {
      "model_type": "clap_text_model"
    },
    "motion_config": {
      "model_type": "clamp_motion_model",
      "hidden_size": 768,
      "codebook_dim": 512,
      "num_hidden_layers":6,
      "codebook_size":1024,
      "down_sampling_ratio":4
    },
    "torch_dtype": "float32",
    "transformers_version": "4.35.0.dev0"
  }
  